// if-else
const dayWeek = 3;
const month = 9;
// 3 місяці літа 1 місяць зими
const isHoliday = (month  === 1) || (month === 6) || (month === 7) || (month === 8);
const isWeekend = (dayWeek === 6) || (dayWeek === 7);

let result ;
if (isHoliday) {
    result = "Ураа, в школу йти не треба, бо канікули";
} else if (isWeekend) {
    result = "Ураа, в школу йти не треба, бо канікули";
} else {
    result =  "Збирай ранець, топай в школу";
}

console.log(result);

// є номер місяця (завжди від 1 до 12) -> програма визначає пору року
// let season;             // Winter, Spring, Summer, Autumn

// const winter = (month === 1) || (month === 2) || (month === 12) ; 
// const spring = (month === 3) || (month === 4) || (month === 5);
// const summer = (month === 6) || (month === 7) || (month === 8);
// const autumn = (month === 9) || (month === 10) || (month === 11);
// if (winter) {
//     season = "Одягайся потепліше, холодно, Зима на дворі.";
// } else if (spring) {
//     season = ("Весна на дворі, всюди квітнуть квіти, але кофтину не забувай")
// } else if (summer) {
// console.log("Літо на дворі, не забуть захист від сонця, але літо є літо, відпочивай")
// } else {
//     console.log("Осінь на дворі, парасолька і гумові чоботи, то є твої осінні друзі.")
// }



/*
1. Навести приклади використання усіх логічних операторів: >, <, &&, ||, <=, >=, !==, ===, !
2. Написати програму, яка правильно перевіряє на високосний рік
3. За номером визначити назву дня тижня. Приклад: 3 -> Wednesday
4. За віком людини визначити категорію:
   1) немовля (0 - 1)
   1.5) малюк (2 - 3)
   2) дитина  ()
   3) підліток
   4) дорослий
   5) старий
   6) дуже старий
*/
