// 2) Перевірка на високосний рік.
// ..., але якщо ділиться на 100, то не високосний, але якщо ділиться на 400, то точно високосний
/*
    1256 - leap
    1290 - not leap
    1300 - not leap
    1200 - leap

<<<<<<< Updated upstream
    1200 % 400 = 0
    1200 % 4 = 0
    1200 % (4 * 100) = 
    число яке ділится на 400 по-любому поділиться і на 4 але не навпаки
=======
const nowYears = 1901;
// // 1901 & 2099 підходить старе правило
// // 1700
>>>>>>> Stashed changes

    1500 % 100 = 0
    1500 % (4 * 25) = 
    
*/

<<<<<<< Updated upstream
const year = 2024;

if (year % 400 === 0) {
  // найсильніша умова
  console.log('Це високосний рік');
} else if (year % 100 === 0) {
  console.log('Це не високосний рік');
} else if (year % 4 === 0) {
  console.log('Це високосний рік');
} else {
  console.log('Це не високосний рік');
}
=======
function capez  (oldYears, newYears) {
    if (0 <= nowYears && nowYears <= 1900) {
        return nowYears = oldYears;
    } else {
        return nowYears = newYears;
    }
}



//   console.log(`${nowYears}  високосний рік, так що рік буде цікавим.`);
// } else {
//     console.log(`${nowYears} не високосний рік, можете розслабитися.`)


/*  проверка на высокосный год, если делится на 4 без остатка но приэтом если взять старый календарь 
до 1900 там вообещ интересная история
если делится на 100 тогда не высокосный, но приэтом если 400 тогда высокосный
если взять по математике  тогда 2024/4=506 (высокосный, так как нет остачи)
1700/100=17 вроде высокосный но приэтом не делится на 400 1700/400=4,25 ( есть остача*/
>>>>>>> Stashed changes
