// 2) Перевірка на високосний рік.
// ..., але якщо ділиться на 100, то не високосний, але якщо ділиться на 400, то точно високосний
/*
    1256 - leap
    1290 - not leap
    1300 - not leap
    1200 - leap

    1200 % 400 = 0
    1200 % 4 = 0
    1200 % (4 * 100) = 
    число яке ділится на 400 по-любому поділиться і на 4 але не навпаки

    1500 % 100 = 0
    1500 % (4 * 25) = 
    
*/

const year = 2024;

if (year % 400 === 0) {
  // найсильніша умова
  console.log('Це високосний рік');
} else if (year % 100 === 0) {
  console.log('Це не високосний рік');
} else if (year % 4 === 0) {
  console.log('Це високосний рік');
} else {
  console.log('Це не високосний рік');
}
